---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.FacetingFactor
source: html/a2b7109c-b57e-a0c1-7b22-578214fe0a24.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.FacetingFactor Property

Faceting factor.
 Default value is 1.0.

## Syntax (C#)
```csharp
public double FacetingFactor { get; set; }
```